{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "010ea42a-692d-4e54-966c-7ed59c8095ae",
   "metadata": {},
   "outputs": [],
   "source": [
    "import neo4j\n",
    "from neo4j import GraphDatabase"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 75,
   "id": "df83da6a-9774-4512-a438-e36b74a95f4d",
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "os.environ.get('MODELSEED_ANNOTATION_CONFIG')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 134,
   "id": "62f91d27-0041-4483-832b-f52011c2e950",
   "metadata": {},
   "outputs": [],
   "source": [
    "URI = \"bolt://192.168.1.15\"\n",
    "dao = Neo4jDAO(URI, \"neo4j\", \"modelseed\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 135,
   "id": "f43243b7-cff4-4d3e-9fca-2082fbfc222d",
   "metadata": {},
   "outputs": [],
   "source": [
    "assert dao.driver.verify_authentication()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 106,
   "id": "e3a6b32d-f19f-4092-90b7-05dd9add6388",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<class 'neo4j._sync.work.transaction.ManagedTransaction'> 4:13856a82-81ae-4d01-b8d8-d60ef5f05bef:333945 RefSeqGenome\n",
      "CPU times: total: 0 ns\n",
      "Wall time: 11.3 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "data_node = dao.get_node(\"4:13856a82-81ae-4d01-b8d8-d60ef5f05bef:333945\", \"RefSeqGenome\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 107,
   "id": "6b45a3f4-f31e-49e5-83a3-85ef34f67435",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: total: 125 ms\n",
      "Wall time: 384 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "res = dao.query(query_cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 133,
   "id": "a07d84ce-57a9-4fee-9602-0c7fc8fe2bd4",
   "metadata": {},
   "outputs": [],
   "source": [
    "dao.driver.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 90,
   "id": "567a5c64-e843-4a2f-a72f-2d34dcade600",
   "metadata": {},
   "outputs": [],
   "source": [
    "genome_id = '4:13856a82-81ae-4d01-b8d8-d60ef5f05bef:333945'\n",
    "query_cypher = f'MATCH (n:RefSeqGenome)-[r:has_gene]-(g:KBaseGene)  WHERE elementId(n) = \"{genome_id}\" RETURN g;'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 101,
   "id": "c8ad81c5-0c36-448b-aa35-5c09eea81c10",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "2230"
      ]
     },
     "execution_count": 101,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(res)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 113,
   "id": "325b9e9b-1c18-42ba-af5a-a9b4496f83f7",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'protein_translation_length': 45,\n",
       " 'aliases': 'alias ## Mlut_23480 ### alias ## GeneID:7985312 ### alias ## GI:488945368 ### alias ## MLUT_RS23165 ### alias ## WP_002856443.1',\n",
       " 'dna_sequence_length': 138,\n",
       " 'functions': 'LSU ribosomal protein L34p',\n",
       " 'protein_md5': '8a5b375ae31ec7c3c207a0d45de134b0',\n",
       " 'protein_translation': 'MTKRTFQPNNRRRARKHGFRARMRTRAGRAILSARRGKNRAELSA',\n",
       " 'id': 'MLUT_RS23165',\n",
       " 'dna_sequence': 'GTGACCAAGCGCACGTTCCAGCCCAACAACCGCCGTCGTGCCCGCAAGCACGGCTTCCGTGCCCGCATGCGCACCCGCGCCGGCCGCGCCATCCTGTCCGCTCGCCGCGGCAAGAACCGCGCCGAGCTGTCCGCCTGA',\n",
       " 'key': 'MLUT_RS23165@GCF_000023205.1',\n",
       " 'mrnas': 'mRNA_2230',\n",
       " 'md5': '8a5b375ae31ec7c3c207a0d45de134b0',\n",
       " 'cdss': 'WP_002856443.1'}"
      ]
     },
     "execution_count": 113,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "res[0].data()['g']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 76,
   "id": "d7f891bc-25e9-461b-a810-89668287d924",
   "metadata": {},
   "outputs": [],
   "source": [
    "dao.driver.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "id": "c79371f5-d18c-4af3-aa0f-c0da562c2b6d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<class 'neo4j._sync.work.transaction.ManagedTransaction'> 4:13856a82-81ae-4d01-b8d8-d60ef5f05bef:63204 KeggOrthology\n",
      "{'updated_at': 1609748980390, 'name': 'ELP1, IKI3, IKBKAP', 'created_at': 1570257386631, 'definition': 'elongator complex protein 1', 'key': 'K11373'}\n"
     ]
    }
   ],
   "source": [
    "def get_node(tx, node_id, node_label):\n",
    "    print(type(tx), node_id, node_label)\n",
    "    result = tx.run(f\"\"\"\n",
    "        MATCH (n:{node_label})\n",
    "        WHERE elementId(n) = $node_id\n",
    "        RETURN n\n",
    "        \"\"\", {\n",
    "        \"node_id\": node_id\n",
    "    }\n",
    "    )\n",
    "    return result.single()\n",
    "with driver.session(database=\"neo4j\") as session:\n",
    "    res = session.execute_read(get_node, node_id=\"4:13856a82-81ae-4d01-b8d8-d60ef5f05bef:63204\", node_label=\"KeggOrthology\")\n",
    "    if res:\n",
    "        print(res.data()['n'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 146,
   "id": "63b0e148-ef49-4730-8f6c-c266e6a66797",
   "metadata": {},
   "outputs": [],
   "source": [
    "set_id = \"4:13856a82-81ae-4d01-b8d8-d60ef5f05bef:6318736\" #\n",
    "set_id = \"ModelSEED2\"\n",
    "query_cypher = f'MATCH (n:GenomeSet)-[r:has_genome]-(g:RefSeqGenome)  WHERE elementId(n) = \"{set_id}\" RETURN g;'\n",
    "query_cypher = f'MATCH (n:GenomeSet)-[r:has_genome]-(g:RefSeqGenome)  WHERE n.key = \"{set_id}\" RETURN g;'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "95a0a1be-f48a-4475-b198-d7b5bb05bd1d",
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_genome_set()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 147,
   "id": "2bda6072-c704-4111-97f9-64bbc15ffbb9",
   "metadata": {},
   "outputs": [],
   "source": [
    "res = dao.query(query_cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 148,
   "id": "be4e62e8-783c-4d3c-842e-627d664833e3",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "1675"
      ]
     },
     "execution_count": 148,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(res)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "354bb8c6-6879-48b8-840e-17ce135d8f40",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'updated_at': 1609748980390,\n",
       " 'name': 'ELP1, IKI3, IKBKAP',\n",
       " 'created_at': 1570257386631,\n",
       " 'definition': 'elongator complex protein 1',\n",
       " 'key': 'K11373'}"
      ]
     },
     "execution_count": 34,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "}\" RETURN g;'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "94a16ab1-685c-471b-98e3-875ecf1b1d47",
   "metadata": {},
   "outputs": [],
   "source": [
    "node_id = 'MATCH (n:KeggOrthology) WHERE elementId(n) = \"4:13856a82-81ae-4d01-b8d8-d60ef5f05bef:63204\" RETURN n;'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 136,
   "id": "aca60c58-7f19-4f27-8443-f8498bcb4fbd",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<class 'neo4j._sync.work.transaction.ManagedTransaction'> 4:13856a82-81ae-4d01-b8d8-d60ef5f05bef:6318736 GenomeSet\n"
     ]
    }
   ],
   "source": [
    "data_node = dao.get_node(\"4:13856a82-81ae-4d01-b8d8-d60ef5f05bef:6318736\", \"GenomeSet\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 161,
   "id": "6fa3afeb-d992-4d43-b04b-e9be38095319",
   "metadata": {},
   "outputs": [],
   "source": [
    "node = data_node['n']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 164,
   "id": "b84d1c97-04b1-4ea9-b47a-0597a3a9f28c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "frozenset({'GenomeSet'})"
      ]
     },
     "execution_count": 164,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "node.labels"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 138,
   "id": "9dfa2383-de1b-4877-abcf-2f30edd83a2d",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'n': {'updated_at': 1591576467540,\n",
       "  'created_at': 1591576467540,\n",
       "  'key': 'Archaea'}}"
      ]
     },
     "execution_count": 138,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "data_node.data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "98f19ce1-e21a-4f39-b88e-c1594ff5a9c7",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Vault\n",
    "genome_set = vault.get_genome_set(\"Archaea\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 132,
   "id": "448da9bd-bc74-41bc-a38a-0669730257fc",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'!'}\n"
     ]
    }
   ],
   "source": [
    "class VaultGenomeSet():\n",
    "\n",
    "    def __init__(self, set_id):\n",
    "        self.id = set_id\n",
    "        self.elements = set()\n",
    "        pass\n",
    "\n",
    "    def add(self, e):\n",
    "        self.elements.add(e)\n",
    "        pass\n",
    "\n",
    "    def __str__(self):\n",
    "        return str(self.elements)\n",
    "    \n",
    "genome_set = VaultGenomeSet()\n",
    "genome_set.add('!')\n",
    "print(genome_set)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 126,
   "id": "e984a78f-7c3b-439e-a384-49db344369a6",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{1}"
      ]
     },
     "execution_count": 126,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "s = set()\n",
    "s.add(1)\n",
    "s"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "8094e8a0-810b-4842-89e5-8b45450937a1",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "b1aa49dc-eb34-45dc-94ad-ebb422aba32c",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 97,
   "id": "2a716116-ef99-4673-99cd-13529eaeb51f",
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "\n",
    "\n",
    "class Neo4jDAO:\n",
    "\n",
    "    def __init__(self, uri: str, user: str, password: str):\n",
    "        self.driver = GraphDatabase.driver(uri, auth=(user, password))\n",
    "\n",
    "    def close(self):\n",
    "        self.driver.close()\n",
    "\n",
    "    @staticmethod\n",
    "    def _get_node(tx, node_id, node_label):\n",
    "        print(type(tx), node_id, node_label)\n",
    "        result = tx.run(f\"\"\"\n",
    "            MATCH (n:{node_label})\n",
    "            WHERE elementId(n) = $node_id\n",
    "            RETURN n\n",
    "            \"\"\", node_id=node_id\n",
    "        )\n",
    "        return result.single()\n",
    "\n",
    "    @staticmethod\n",
    "    def _query(tx, query):\n",
    "        result = tx.run(query)\n",
    "        return [o for o in result]\n",
    "\n",
    "    def get_node(self, node_id: str, node_label: str) -> dict:\n",
    "        with self.driver.session(database=\"neo4j\") as session:\n",
    "            return session.execute_read(Neo4jDAO._get_node, node_id, node_label)\n",
    "\n",
    "    def query(self, query: str):\n",
    "        with self.driver.session(database=\"neo4j\") as session:\n",
    "            return session.execute_read(Neo4jDAO._query, query)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f4dac61f-ccd7-468c-9360-68763bf382fe",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "modelseed",
   "language": "python",
   "name": "modelseed"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
